package com.javarush.task.task18.task1802;

import java.io.BufferedReader;
import java.io.FileInputStream;
import java.io.InputStreamReader;

/* 
Минимальный байт
*/

public class Solution {
    public static void main(String[] args) throws Exception {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        String fileName = reader.readLine();
        int min = Integer.MAX_VALUE;
        try {
            FileInputStream inputStream = new FileInputStream(fileName);
            while (inputStream.available() > 0){
                int current = inputStream.read();
                min = current < min ? current: min;


            }
            System.out.println(min);
            inputStream.close();
        }
        catch (Exception e){
            e.printStackTrace();
        }

    }


}
/*
Минимальный байт
Ввести с консоли имя файла.
Найти минимальный байт в файле, вывести его на экран.
Закрыть поток ввода-вывода.


Requirements:
1. Программа должна считывать имя файла с консоли.
2. Для чтения из файла используй поток FileInputStream.
3. В консоль должен выводиться минимальный байт, считанный из файла.
4. Поток чтения из файла должен быть закрыт.
 */